
[
  {
    "id": "type_1",
    "type_number": "Type 1",
    "Type Summary": "Type Ones are driven by a deep need for integrity and improvement, striving to make themselves and the world more ethical, fair, and whole. Their disciplined nature and moral clarity inspire trust, though they must learn to temper rigidity with compassion.",
    "Type Description": "Type Ones carry an inner compass that points them toward honesty, responsibility, and high standards. They see what’s broken or out of alignment and feel compelled to correct it, often becoming agents of reform and integrity in their environments. Their genius lies in their principled discernment and ability to elevate systems, communities, and people through order and excellence. At their best, Ones bring clarity and justice without judgment, balancing their drive for improvement with grace. When stressed, they can become overly critical or rigid, but when aligned, they embody integrity that uplifts and inspires others. Their higher purpose is to restore wholeness and integrity wherever they go.",
    "Core Drive / Key Motivation": "To be good, right, ethical, principled.",
    "Genius / Gifts / Talents": "Type 1s are naturally skilled at noticing what’s inconsistent, incorrect, or “off,” and they bring a sharp eye for detail into everything they do. They excel at producing precise, high-quality work and pride themselves on timeliness and efficiency. With a strong sense of integrity, they instinctively set plans, organize priorities, and strive for self-improvement over time. Discipline and focus come easily to them, as does carrying themselves with politeness and respect. Type 1s are deeply committed to excellence, often bringing a meticulous approach to tasks, and they lead with honesty and fairness as guiding principles.",
    "Underlying Fear": "Fear of being bad, wrong, corrupt, imperfect. Avoids mistakes and criticism.",
    "Core Values": "Accomplishment, Accuracy, Career Fulfillment, Challenge, Civility, Close relationships, Commitment, Community, Competence, Conscientiousness, Contribution, Creativity, Duty, Ethical behavior, Excellence, Faith / spirituality, Family, Fidelity, Financial Security, Fairness, Good manners, Hard Work, Health & Wellness, Helping Others, Honesty, Humility, Independence, Integrity, Loyalty, Learning, Mission, Organization, Perseverance, Personal Development, Physical Fitness, Practicality, Precision, Principles, Prudence, Reliability, Respect for others, Respectability, Responsibility, Righteousness, Self-Control, Self-Discipline, Self-Sacrifice, Service, Stability, Structure, Trustworthiness, Truthfulness, Virtue, Work/Life Balance.",
    "Strengths": "Steadfast, principled, and dedicated to integrity. They bring order from chaos, notice the details others miss, and strive for excellence. Their commitment to honesty, quality, and moral goodness inspires trust and elevates the standards of those around them.",
    "Growth Edge / Blind Spot": "Allowing imperfection, embracing joy.",
    "Decision-Making Style": "Careful, principled, rule-based.",
    "Ideal Environment Needs": "Clear structures, fairness, order.",
    "Stress / Breakdown Patterns": "Overwork, rigidity, resentment.",
    "Action Words": "Type 1s are driven to empower, educate, advocate, teach, demonstrate, and exemplify.",
    "Energy Signature": "Self-Discipline. Organization. Responsibility. Education. Improvement. Integrity.",
    "Role Alignment Hints": "Type 1s thrive in roles where integrity, fairness, and precision are core values, and where they can actively improve systems and raise standards. They shine when trusted to deliver quality work with meaning and purpose, but struggle in environments that cut corners or compromise thoroughness.",
    "Examples of Aligned Roles": "Accountant, Accounting, Activist, Alternative Healthcare Practitioner, Appraiser, Arbitrator, Architect, Archivist, Assessor, Athletics Dept. Head, Auditor, Author, Billing & Accounts, Bookkeeper, Career Coach, Carpenter, Chaplain, Child Support Abuse Investigator, Clinical Psychologist, Copywriter, Construction Manager, Correctional Treatment Specialist / Officer, Court Reporter, Criminal Investigator, Critic, Developmental Psychologist, Doctor, Editor, Electrician, Engineer, Entrepreneur, Environmentalist, Estate Planner, Evangelist, Examiner, Executive position, Exercise Physiologist, Federal Marshal, Financial planner, Guidance Counselor, Government Employee, Health Sciences, Holistic health practitioner, Home design blogger, Humanities Professor, Hygienist, Industry Safety / Health Engineer, Information Architecture, Inspector, Instrument Maker, Interior designer, IRS Agent, Journalist, Judge, Law Enforcement, Lawyer, Leader of Movement / Cause, Library Sciences, Lobbyist, Logistics Manager, Manager, Management Consultant, Martial Arts Teacher, Mathematician, Mechanic, Military Personal / Military Career, Missionary, Negotiator, Network Systems Analyst, Nurse, Nutritionist, Orthodontist, Optometrist, Paralegal, Personal Organizer, Pharmacist, Physician Assistant, Police Investigator, Politician / Activist, Professor, Psychotherapist / Psychiatrist, Publishing, Quality Control, Research & Development, Real estate agent, Referee, Religious Worker, Reviewer / Evaluator, Security Officer, Secretary, Scientist, School Principal, Sheriff, Social Worker / Advocate, Special Agent, Statistician, Strategic Planner, Stock Broker, Surgeon, Tailor, Tax preparer, Therapist, Technology (Systems Analyst), Technical Writer, Trade Union Leader, Trainer, Tutor, University Professor, Veterinarian, Warden, Web Developer, Webmaster",
    "Leadreship Style": "Type 1 leaders bring integrity, responsibility, and a strong moral compass. They set high standards, model ethical behavior, and inspire trust through fairness and consistency. Their gift lies in improving systems, upholding excellence, and creating order that benefits the greater good.",
    "Type Nicknames": "The Reformer. The Perfectionist. The Crusader. The Teacher. The Judge. The Organizer.",
    "Highest Work Fulfillment & Reward": "You thrive in environments that emphasize harmony, cooperation, and steady progress. Roles that involve listening, mediating, and fostering unity align with your gifts. You feel most fulfilled when your patience, empathy, and calm presence help bring people together in supportive, non-pressured ways."
  },
  {
    "id": "type_2",
    "type_number": "Type 2",
    "Type Summary": "Type 2s are generous, empathetic leaders who thrive on connection and service, but their true power emerges when they balance caring for others with caring for themselves. By learning to set boundaries and draw worth from within, they lead with authenticity, resilience, and a heart that inspires trust.",
    "Type Description": "Enneagram Type 2, the Helper, is driven by a deep desire to love and be loved, often pouring energy into meeting the needs of others. Their warmth, intuition, and generosity create strong bonds and supportive communities, yet they can lose themselves when overextending or seeking validation through service. Misalignment shows up as exhaustion, resentment, and an identity tethered to being indispensable. Alignment comes when Type 2s honor their own needs, practice self-care, and develop emotional resilience. In this space, their leadership transforms — no longer fueled by people-pleasing, but by grounded compassion and inner confidence. At their best, Type 2s embody the gift of wholehearted connection, uplifting others while modeling the strength of self-love and balance.",
    "Core Drive / Key Motivation": "To feel loved and needed by others.",
    "Genius / Gifts / Talents": "Type 2s are gifted in empathizing with people and intuitively understanding what others most need. They shine in nurturing and consoling roles, building close relationships, and cultivating a sense of community. Naturally affirming, they offer heartfelt encouragement and insightful advice that helps resolve challenges. Their kindness lifts others up, empowering them to thrive. They see the good in people, put others at ease, and create environments where connection flourishes. With a talent for gathering support and resources for those in need, they lead with generosity, care, and the ability to mobilize compassion into action.",
    "Underlying Fear": "Fear of being unwanted or unloved. Avoids rejection or being unneeded.",
    "Core Values": "Affection, A loving, intimate partnership, Altruism, Association with others, Being appreciated and loved, Being needed, Being useful, Bettering the world, Care, Career fulfillment/success, Charitableness, Close relationships, Close group/team work, Collaboration/team work, Cooperation, Compassion for others, Cordiality, Consideration, Emotional connection, Empathy for others, Faith/spiritual connection, Family, Friendliness, Financial security/comfort, Fostering development, Generosity, Harmony, Helpfulness, Helping others directly, Inner peace, Integrity, Joy, Kindness, Lots of people contact, Love, Meaningful work, Nurturance, Open communication, Openness, Partnerships, Praise, Positive influence, Responsiveness to others’ needs, Sense of mission, Service to others, Sociability, Spiritual faith, Sympathy, Thoughtfulness, Understanding.",
    "Strengths": "Empathic, warm, and generous of spirit. They instinctively sense others’ needs, offering love, kindness, and encouragement. With social intelligence and genuine appreciation, they create deep connections that make people feel valued and seen.",
    "Growth Edge / Blind Spot": "Learning to receive love freely.",
    "Decision-Making Style": "People-focused, relational.",
    "Ideal Environment Needs": "Supportive teams, appreciation culture.",
    "Stress / Breakdown Patterns": "Burnout from over-helping, resentment.",
    "Action Words": "Type 2s naturally love, nurture, offer, support, serve, please, and empathize.",
    "Energy Signature": "Self-Sacrifice. Altruism. Empathy. Nurturance. Generosity. Connection.",
    "Role Alignment Hints": "Type 2s thrive in roles that allow them to care for, uplift, and meaningfully connect with others. They shine when their generosity and empathy are valued, but can burn out if they sacrifice their own needs or feel unappreciated.",
    "Examples of Aligned Roles": "Account executive, Activist, Advice columnist, Advertising executive, Advocate, Actor/Actress, Art and Creativity Teacher, Artist, Assistant / Executive Assistant, Astrologer, Bartender, Bed and breakfast owner, Bilingual education teacher, Blogger/vlogger, Bodily-Kinesthetic intelligence, Campaigner Crusader, Caretaker, Caterer, Child care provider, Chiropractor, Clairvoyant / Psychic, Coach, Consultant, Cook / Chef / Baker, Counselor, Comedian, Customer Service, Customer Service Representative, Dancer, Decorator, Director of religious education, Diversity manager, Doctor, Doula, Drug and alcohol addiction specialist, Educational administrator, Elementary school teacher, Employment interviewer, Energetic healer, Engagement & wedding photographer, Entertainer, Esthetician, Event or party planner, Exercise physiologist, Family physician, Filmmaker, Florist, Foster Parent, Hair stylist, Healer, Healthcare administrator, Healthcare worker (any), Health educator, Healthy & Happy Wellness Services, Home economics teacher, Home health aide / social worker, Hospitality Industry / Worker, Hospice nurse/worker, Human Resource Manager, Human Resources, Humanitarian Worker, Illustrator, Industrial psychologist, Interior designer, Jeweler, Licensed practical nurse (LPN), Makeup Artist, Marketer of ideas/services, Marriage and Family Therapist (MFT), Massage therapist, Mediator, Medical assistant, Medical secretary, Mental health professional, Ministry Work, Missionary, Musician/singer, Non-profit organization worker, Nun/Monk, Non Profit Leader, Non-Profit Organization Owner / Worker, Nurse / Nurse Instructor, Nursing home worker, Nutritionist/Dietitian, Occupational therapist (OTR), Optometrist/optician, Painter, Pastor, Pediatrician, Photographer, Physical therapist (PT), Physical therapy assistant (PTA), Physician assistant (PA), Poet, Political supporter, Preacher/minister, Primary care physician, Professor, Psychotherapist, Public service worker, Real estate agent, Receptionist Secretary, Relationship expert, Religious Leader, Respiratory therapist, Sales Representative, School principal, School psychologist, School social worker, Sculptor, Seminar leader, Singer, Social director/leader, Social worker, Sociologist, Speech language pathologist (SLP), Tarot card reader, Teacher (of any kind), Therapist, Veterinarian, Volunteer / Volunteer Teacher, Waitress, Wedding planner / Coordinator, Writer (esp Romance / Fantasy), Working for or starting a non-profit.",
    "Leadreship Style": "Type 2 leaders lead with warmth, empathy, and a genuine desire to support others. They excel at building relationships, motivating through encouragement, and cultivating loyalty. Their leadership shines when they create environments of collaboration and belonging, where people feel valued and cared for.",
    "Type Nicknames": "The Giver. The Helper. The Nurturer. The Resourceful One. The Advisor. The Supporter.",
    "Highest Work Fulfillment & Reward": "Type 2s flourish in roles that allow them to connect, nurture, and make others feel valued. They need work that emphasizes empathy, generosity, and collaboration, while also respecting their own needs. They feel most fulfilled when their intuition, kindness, and ability to uplift others create lasting impact and make the world more compassionate."
  },
  {
    "id": "type_3",
    "type_number": "Type 3",
    "Type Summary": "Type 3s are driven visionaries who channel ambition, adaptability, and charisma into tangible results, yet their deepest fulfillment comes not from external success but from aligning with authenticity, values, and genuine connection. When they pause the chase for approval and lead from their true self, they transform achievement into lasting impact and soulful leadership.",
    "Type Description": "Enneagram Type 3s embody determination, productivity, and a magnetic presence that inspires others to aim higher. Their gift is turning vision into action and momentum, often becoming the spark that mobilizes teams and movements. Yet beneath their polished competence lies a longing for authenticity—an ache that arises when achievements mask vulnerability or when worth becomes tied to external validation. The journey for Type 3s is not to abandon ambition, but to infuse it with self-awareness, values, and heart, so that success feels soul-satisfying rather than hollow. At their best, they balance drive with presence, competition with compassion, and outcomes with relationships. In doing so, they model a new form of leadership—one that is both inspiringly effective and deeply human.",
    "Core Drive / Key Motivation": "To feel valuable, successful, admired.",
    "Genius / Gifts / Talents": "Type 3s excel at initiating and taking the lead, motivating and inspiring others to achieve their potential. They are disciplined, hard-working, and capable of balancing multitasking with deep concentration when needed. Their influence is powerful, and they often frame setbacks as opportunities to learn and grow. Charismatic and charming, they can “sell” ideas, people, or projects with ease, while also being self-supporting and independent in pursuit of their own success. They anticipate positive outcomes, dream big, and help others to do the same—instilling drive, optimism, and the confidence to reach for more.",
    "Underlying Fear": "Fear of being worthless or failing. Avoids failure, insignificance.",
    "Core Values": "A can-do attitude, Accomplishment, Achieving goals, Admiration, An enterprising spirit, Being desirable, Being the best, Belief in themselves, Career fulfillment/success, Challenge, Championing others, Commitment to excellence, Competence, Contact with others, Determination to “make it,” Developing self and others, Developing human potential, Distinction, Efficiency, Excellence, Excitement, Excitement and adventure, Fame, Financial security, Goal achievement, Hard-work ethic, Helping others succeed, Influence, Leadership, Living the good life, Looking good, Meaningful work, Ongoing learning, Optimism, Personal growth, Personal recognition, Physical attractiveness, Popularity, Positive thinking, Power and authority, Prestige, Professional recognition, Prominence, Recognition, Renown, Reputation, Self-confidence, Status, Success, Time/schedule flexibility.",
    "Strengths": "Driven, adaptable, and laser-focused on success. They bring energy, confidence, and efficiency to every goal. With their ability to plan, persuade, and execute, they inspire others by showing what’s possible through persistence and excellence.",
    "Growth Edge / Blind Spot": "Valuing being over doing.",
    "Decision-Making Style": "Fast, strategic, efficiency-driven.",
    "Ideal Environment Needs": "Competitive, goal-oriented environments.",
    "Stress / Breakdown Patterns": "Workaholism, identity loss.",
    "Action Words": "Type 3s seek to empower, influence, show, inspire, revolutionize, enhance, and motivate.",
    "Energy Signature": "Ambition. Self-Esteem. Influence. Excellence. Achievement. Drive.",
    "Role Alignment Hints": "Type 3s thrive in roles that are fast-paced, results-driven, and reward their ambition and efficiency. They shine when their drive for excellence inspires others, but risk burnout if recognition becomes more important than authentic fulfillment.",
    "Examples of Aligned Roles": "Accountant, Actor/Actress, Administrator, Advertising Consultant, Agent (sports, literary, entertainment), Any Ph.D. profession, Architect, Artist, Attorney, Bank president, Business executive, Brand Ambassador, Business, Business Administration, CEO of a company, CEO or president, CHO, CIO, CKO, CMO, CPO, CQO, CPA, CRO, CSO, CTO, CVO, CWO, Captain, Chief Officer (CEO, CFO, COO, CAO), Commander in chief, Corporate trainer, Dancer / Dancing instructor, Day trader (in the stock market), Dentist, Director, Director (stage, motion picture, TV), Disc jockey, Engineer, Entertainment agent, Entrepreneur, Executive coach, Fashion designer, Film/TV producer, Financial planner/investor, Fitness instructor or personal trainer, Fashion Designer, Financial Analyst, Image consultant, Internet marketer, Investment Banker, Journalist, Lawyer, Life coach / Business Coach, Makeup artist, Makeup specialist, Manager, Marketer, Marketing Manager, Marketing Director, Media Planner, Medical Doctor, Military officer, Minister, Model, Motivational Speaker, Multi-level marketer, NLP coach/seminar leader, Networking expert, Nutrition counselor, Pastor, Performer, Personal development guru, Pilot, Plastic Surgeon, Podcast host, Politician, Producer, Professional Athlete, Professional Sports Coach, Promoter, Public relations director/specialist, Publicist, Publicity writer, Real Estate Agent or Broker, Real Estate Developer, Scientist, Singer, Social Media Management, Speaker, Sports / Entertainment Agent / Sportscaster, Stockbroker, Stylist, Superintendent, Supervisor, Surgeon, Talk Show Host, University professor, Venture capitalist, Veterinarian.",
    "Leadreship Style": "Type 3 leaders inspire through drive, efficiency, and an ability to achieve results. They are vision-setters who mobilize teams with energy, confidence, and a “can-do” spirit. Their leadership contribution is in turning goals into reality, encouraging excellence, and elevating others to succeed alongside them.",
    "Type Nicknames": "The Achiever. The Performer. The Mentor. The Climber. The Showstopper. The Motivator.",
    "Highest Work Fulfillment & Reward": "Type 3s excel in stimulating, results-oriented environments where productivity and success are rewarded. They need roles that let them initiate, take risks, and work with capable, driven people. They feel most fulfilled when their efficiency, leadership, and motivational energy are recognized and contribute to tangible achievements."
  },
  {
    "id": "type_4",
    "type_number": "Type 4",
    "Type Summary": "Type 4s are seekers of authenticity and meaning, driven by creativity and emotional depth. At their best, they transform longing and self-doubt into soulful leadership that inspires others through honesty, artistry, and genuine connection.",
    "Type Description": "Enneagram Type 4s bring a rare gift of emotional depth, imagination, and authenticity. They long to express their individuality and create work that feels meaningful, often wrestling with self-doubt, comparison, and a sense of being different. When aligned, they ground their intensity in action and self-acceptance, turning vulnerability into strength and artistry into impact. Their leadership inspires others not by fitting into conventional molds, but by embodying what it means to live and lead from the heart. Rooted in truth and guided by creativity, Type 4s can shape environments where originality, beauty, and genuine human connection flourish.",
    "Core Drive / Key Motivation": "To find themselves and their unique significance.",
    "Genius / Gifts / Talents": "Type 4s bring depth, authenticity, and creativity to everything they do. They support others in developing their potential while also speaking universal truths about the human condition. With an innate ability to empathize with pain and suffering, they often create works that are inspiring, poetic, meaningful, and beautiful. Their sincerity and self-honesty invite others to be genuine, while their ability to recognize and create meaning transforms experiences into something deeply significant. They are naturally expressive, romantic, and sensitive, creating ambiance and beauty in their surroundings and inspiring others to express themselves with courage and authenticity.",
    "Underlying Fear": "Fear of being insignificant, flawed, without identity. Avoids ordinariness.",
    "Core Values": "Aesthetics, A loving, intimate partnership, Artistic creativity, Authenticity & Individualism, Beauty, Being seen as unique, Being true to oneself, Change and variety, Compassion for other’s suffering, trials, and tribulations, Contribution, Continual self-renewal, Deep feelings, Depth/Profundity, Developing self and others, Empathy, Excitement and adventure, Finding meaning in everything that happens, Finding true love, Following one’s heart, Freedom, Helping others directly, Imagination, Inspiring others, Insightfulness, Intensity, Intimacy, Introspection, Intuition, Ironic, off-beat humor, Independence, Influence on people’s lives, Integrity, Meaningful work, Musing, Non-conformity, Open communication, Originality, Passion, Personal freedom, Personal growth, Quality (only the finest/best), Romance & Love, Emotional Vulnerability, Seeking Knowledge, Self-awareness & improvement, Self-expression, Self-understanding & revelation, Sense of mission, Sensitivity, Soulful connections, Time/schedule flexibility.",
    "Strengths": "Deeply attuned to emotion and meaning. They transform raw feeling into beauty, originality, and authenticity. Their creativity and intuition help others touch what’s real and profound, reminding us that life’s intensity is a source of depth and wonder.",
    "Growth Edge / Blind Spot": "Self-worth without comparison.",
    "Decision-Making Style": "Intuitive, values-driven, emotional.",
    "Ideal Environment Needs": "Aesthetic, emotionally open spaces.",
    "Stress / Breakdown Patterns": "Melancholy, withdrawal.",
    "Action Words": "Type 4s are moved to identify, align, authenticate, express, understand, create, and illuminate.",
    "Energy Signature": "Self-Awareness. Self-Revelation. Individualism. Artistic Creativity. Authenticity. Depth.",
    "Role Alignment Hints": "Type 4s thrive in roles that honor creativity, authenticity, and depth of expression. They shine when they can bring beauty, meaning, and emotional insight into their work, but may struggle in environments that feel shallow, rigid, or dismissive of individuality.",
    "Examples of Aligned Roles": "Actor/actress, Advertising (for a brand they believe in), Advisor, Architect, Artist, Art and creativity teacher, Art Director, Astrologer, Aura Color Seer, Author, Bilingual education, Cartoonist, Caregiver/caretaker, Chakra Healer, Chiropractor, Choreographer, Cinematographer, Clairvoyant/Medium/Psychic/Spiritualist, Composer, Conductor, Corporate trainer, Costume and wardrobe specialist, Counselor, Creative Writing, Creative Teacher, Crisis Line Operator, Dance Instructor, Decorator, Designer, Dramatist, Editor/Art director, EFT Specialist, Energy Healer, Entrepreneur, Fashion designer, Feng Shui or Vastu expert, Fiction writer, Filmmaker, Fine art photographer, Floral designer / Florist, Graphic Designer, Hair Stylist, Holistic health practitioner, Human resources personnel, Illustrator, Influencer, Instrumentalist, Interior designer, Jewelry maker, Journalist, Librarian, Life coach, Makeup Artist, Masseuse, Math or Science teacher, Missionary, Motivational speaker, Musician, Music Producer, Music teacher, NLP practitioner, Novelist, Nutritionist, Personal Trainer, Performer (any), Personality system expert (typologist), Philosopher, Photographer, Playwright, Poet, Potter (pottery maker), Preacher, Printmaker, Reflexologist, Reiki practitioner, Screenwriter, Sculptor, Seminar leader, Set / Costume Designer, Shaman, Singer, Small business owner, Social media manager, Special education teacher, Spiritual teacher/guide, Tarot card reader, Tattoo Artist, Teacher’s assistant, Therapist, UX / UI Designer, UX Researcher, Videography / photography, Writer, Yoga Instructor.",
    "Leadreship Style": "Type 4 leaders bring depth, creativity, and emotional intelligence to their leadership. They inspire by being genuine, visionary, and attuned to meaning and purpose. Their strength lies in helping others embrace authenticity, fostering innovation, and creating environments where individuality and soulful expression are honored.",
    "Type Nicknames": "The Creative. The Intuitive. The Romantic. The Deep Diver. The Individualist. The Dreamer.",
    "Highest Work Fulfillment & Reward": "Type 4s thrive in work that honors authenticity, creativity, and depth. They need environments that allow freedom, flexibility, and meaningful self-expression. They feel most fulfilled when their unique vision, intuitive sensitivity, and ability to create beauty and meaning help others connect more deeply with themselves and life."
  },
  {
    "id": "type_5",
    "type_number": "Type 5",
    "Type Summary": "Type 5s are insightful investigators who seek knowledge, independence, and clarity, often retreating inward to feel safe and capable. Their gift is turning depth of thought into wisdom that empowers others, provided they balance solitude with connection and contribution.",
    "Type Description": "Type 5s are natural observers and thinkers, driven by an insatiable curiosity and a need to understand the world around them. They thrive in environments where they can analyze deeply, innovate independently, and bring forward fresh, often unconventional insights. At their best, they transform complexity into clarity and inspire others through their unique blend of objectivity, logic, and visionary perspective. Yet, their desire to conserve energy and protect their inner world can lead to withdrawal, emotional detachment, or a fear of being overwhelmed or inadequate. When aligned, Type 5s embrace both their inner reserves of knowledge and the richness of human connection, sharing their wisdom generously and leading with both intellectual depth and authentic presence. In doing so, they embody the role of the wise guide whose genius lights the way for others.",
    "Core Drive / Key Motivation": "To be capable, competent, informed.",
    "Genius / Gifts / Talents": "Type 5s are natural investigators and synthesizers, drawing together diverse ideas into fresh perspectives. They thrive on diving deep into subjects, inventing theories, and building systems that explain how things work. Sharing findings with excitement and wonder, they inspire curiosity in others. Naturally focused and contemplative, they excel at researching, analyzing, and solving complex problems with creativity and strategic vision. They debate ideas, critique inconsistencies, and quickly learn new concepts, often becoming experts in their chosen fields. Their leadership comes through clarity, innovation, and the joy of discovery.",
    "Underlying Fear": "Fear of being useless, incapable, overwhelmed. Avoids intrusion or depletion.",
    "Core Values": "Alone time, Astuteness, Autonomy, Being forewarned & armed, Cleverness, Competence, Complex problem solving, Contributing ideas, Craftsmanship, Creativity, Curiosity, Discernment, Discovery, Emotional self-control, Exploration, Fairness, Foresight, Forethought, Freedom to pursue personal interests, Goal achievement/career success, Healthy questioning, Impartiality, Independence, Ingenuity, Inquisitiveness, Insightfulness, Intellectual challenge, Intellectual stimulation, Intelligence, Inventiveness, Innovation and originality, Intellectual achievement and status, Ironic, dry wit, Judiciousness, Knowledge & Understanding, \"Live & let live,\" Logical analysis, Objectivity, Open-mindedness, Ongoing learning potential, Perceptiveness, Predictability, Privacy, Solitude, & Confidentiality, Problem solving, Prudence, Rationality, Resourcefulness, Self-reliance & Working alone, Thrift, Time to prepare, Time/schedule flexibility, Unemotional decision making, Wisdom.",
    "Strengths": "Observant, curious, and wise. They see patterns and assemble insights with clarity and objectivity. Independent and resourceful, they solve complex problems with precision and creativity, offering knowledge and innovative solutions that enrich others.",
    "Growth Edge / Blind Spot": "Embodying and sharing presence.",
    "Decision-Making Style": "Analytical, cautious, data-driven.",
    "Ideal Environment Needs": "Privacy, space, intellectual freedom.",
    "Stress / Breakdown Patterns": "Isolation, depletion.",
    "Action Words": "Type 5s are inclined to learn and know, explore, synthesize, observe, share, question, and experiment.",
    "Energy Signature": "Contributing ideas",
    "Role Alignment Hints": "Type 5s thrive in roles that provide autonomy, intellectual challenge, and space for deep expertise. They shine when trusted for their insight and innovation, but falter in environments that are overly intrusive, emotionally chaotic, or micromanaging.",
    "Examples of Aligned Roles": "Academic, Accountant, Actuary, Analyst, Anthropologist, Archaeologist, Architect, Archivist, Astronomer, Author, Biochemist, Biologist, Botanist, Chess player, Chemist, Clinical Psychologist, College Professor, Computer Programmer, Computer Scientist, Consultant, Cryptographer, Data Analyst, Data Scientist, Dentist, Developer, Doctor, Economist, Editor, Engineer, Entrepreneur, Environmentalist, Financial Analyst, Forensic Scientist, Geneticist, Geographer, Geologist, Historian, Information Architect, Inventor, Investment Banker, IT Specialist, Journalist, Judge, Lawyer, Librarian, Logician, Market Research Analyst, Mathematician, Mechanical Engineer, Medical Researcher, Neuroscientist, Novelist, Nuclear Scientist, Nurse, Nutritionist, Paralegal, Philosopher, Photographer, Physicist, Physician, Political Scientist, Professor, Programmer, Psychiatrist, Psychologist, Psychotherapist, Publisher, Researcher, Scientist, Social Scientist, Sociologist, Statistician, Surgeon, Systems Analyst, Teacher, Technical Writer, Theologian, Think Tank Member, Translator, University Administrator, Urban Planner, Virologist, Web Developer, Writer, Zoologist.",
    "Leadreship Style": "Type 5 leaders contribute clarity, insight, and intellectual rigor. They lead with objectivity, deep analysis, and innovative problem-solving. Their gift is creating sustainable systems, offering well-researched guidance, and ensuring decisions are grounded in wisdom and foresight.",
    "Type Nicknames": "The Observer. The Thinker. The Investigator. The Engineer. The Analyst. The Sage.",
    "Highest Work Fulfillment & Reward": "Type 5s flourish in roles that value independence, expertise, and innovation. They need work that allows them to explore deeply, solve problems, and think freely without unnecessary interference. They feel most fulfilled when their curiosity, analytical skills, and inventive thinking lead to insight, progress, and mastery."
  },
  {
    "id": "type_6",
    "type_number": "Type 6",
    "Type Summary": "Type 6s are loyal guardians who long for safety and truth, often scanning for threats while craving the courage to trust themselves. When they lean into self-trust, they transform fear into steadfast leadership, offering reliability, courage, and a deep sense of protection to others.",
    "Type Description": "At their core, 6s are driven by a desire for security, loyalty, and trustworthy connection. They carry a vigilant mind that scans for what could go wrong, which makes them both natural protectors and at times prisoners of doubt. This inner tension often shows up as indecision, overthinking, or seeking reassurance—yet beneath it lies a fierce courage and unwavering commitment once they feel grounded in trust. When aligned, Sixes shift from anxiety to courage, from suspicion to faith in themselves and others. Their leadership shines through dependability, foresight, and the ability to steady others in uncertain times. In purpose and career, they thrive when their work allows them to safeguard, guide, and strengthen communities while also cultivating their own inner security and self-trust.",
    "Core Drive / Key Motivation": "To find safety, guidance, certainty.",
    "Genius / Gifts / Talents": "Type 6s are gifted in building trust, demonstrating loyalty, and committing fully to their responsibilities. They are dependable and keep their word, while also acting as protectors who sense and prevent danger. With a natural vigilance, they rescue others from harm and defend those who are vulnerable. They excel at spotting flaws and inconsistencies, critiquing carefully, and approaching challenges with systematic and methodical care. They bring people together, foresee problems before they arise, and create environments of safety and security. Their leadership is grounded, protective, and marked by steadfast reliability.",
    "Underlying Fear": "Fear of being without support or guidance. Avoids uncertainty and insecurity.",
    "Core Values": "Affiliation, Being helpful, Belonging, Bonding with others, Cautiousness, Clear directions, Close friendships, Close group/team work, Collaboration, Commitment, Community, Compassion for others, Concern for loved ones, Conscientiousness, Cooperation, Community involvement opportunities, Dependability, Dutifulness, Egalitarianism, Empathy for others, Faithfulness, Fidelity, Hard-work ethic, Healthy skepticism, Intelligence, Loyalty, Meaningful work, Ongoing learning potential, Open, honest communication, Positive influence, Perseverance, Persistence, Practicality, Precision work, Predictability, Protectiveness, Prudence, Reliability, Responsibility, Saving money, Security, Seeking understanding, Self-sacrifice, Sense of humor, Sense of mission, Sensibleness, Stability, Strategic problem solving, Supportiveness, Thoroughness, Trustworthiness, Trust, Wittiness.",
    "Strengths": "Courageous, prepared, and devoted. Their vigilance uncovers hidden risks while their loyalty builds trust. With teamwork, wit, and protectiveness, they create safety and reliability for others, ensuring no one faces life’s challenges alone.",
    "Growth Edge / Blind Spot": "Trusting intuition over fear.",
    "Decision-Making Style": "Cautious, worst-case oriented.",
    "Ideal Environment Needs": "Stable, trustworthy environments.",
    "Stress / Breakdown Patterns": "Anxiety, paralysis, overcommitting.",
    "Action Words": "Type 6s work to connect, notice and sense, foresee, protect, serve, inspect, and support.",
    "Energy Signature": "Group Identification. Trust. Protection. Commitment. Vigilance. Loyalty.",
    "Role Alignment Hints": "Type 6s thrive in roles that offer stability, collaboration, and a clear structure. They shine when their loyalty, thoroughness, and protective instincts are valued, but can struggle if trust is broken or the environment feels unpredictable.",
    "Examples of Aligned Roles": "Accountant, Administrative Assistant, Analyst, Architect, Auditor, Banker, Bookkeeper, Business Manager, Career Counselor, Chaplain, Chemist, Child Care Worker, Civil Servant, Clergy, Coach, Computer Programmer, Consultant, Corporate Trainer, Counselor, Customer Service Representative, Data Analyst, Dentist, Doctor, Economist, Editor, Electrician, Engineer, Environmentalist, Financial Advisor, Firefighter, Government Employee, Guidance Counselor, Health Care Worker, Historian, Human Resources Specialist, Insurance Agent, Investigator, IT Specialist, Judge, Lawyer, Librarian, Manager, Mechanic, Military Officer, Minister, Nurse, Nutritionist, Paralegal, Pharmacist, Physical Therapist, Physician, Pilot, Police Officer, Politician, Professor, Programmer, Psychologist, Researcher, Scientist, Security Officer, Social Worker, Soldier, Statistician, Teacher, Technical Writer, Technician, Union Leader, Veterinarian.",
    "Leadreship Style": "Type 6 leaders bring reliability, commitment, and vigilance. They excel at anticipating risks, ensuring safety, and building stable structures that others can depend on. Their leadership style creates trust and resilience by balancing caution with courage and fostering teamwork through loyalty and shared responsibility.",
    "Type Nicknames": "The Loyalist. The Skeptic. The Guardian. The Rescuer. The Troubleshooter. The Watcher.",
    "Highest Work Fulfillment & Reward": "Type 6s thrive in environments that prioritize trust, collaboration, and security. They need roles where their loyalty, diligence, and foresight are appreciated, with clear structures that allow them to work carefully and systematically. They feel most fulfilled when their protective instincts, problem-spotting, and commitment help build safe and dependable systems."
  },
  {
    "id": "type_7",
    "type_number": "Type 7",
    "Type Summary": "Type 7s are visionaries who bring light, energy, and possibility into any space. At their best, they turn boundless curiosity into meaningful creation by balancing joy with presence and commitment.",
    "Type Description": "Type 7s, the Enthusiasts, are fueled by optimism, adventure, and an endless hunger for experience. They are natural innovators, able to see opportunities where others see obstacles, and they inspire people with their expansive imagination and enthusiasm. Yet their brilliance can scatter when they chase novelty or avoid discomfort, leaving commitments unfinished. Their deeper purpose emerges when they slow down, stay present, and engage fully with both joy and challenge. By learning to savor the moment, honor their commitments, and welcome even difficult emotions, Sevens transform their restless drive into a powerful, grounded vision—creating lives and careers that are both adventurous and deeply fulfilling.",
    "Core Drive / Key Motivation": "To be satisfied and free, experiencing life fully.",
    "Genius / Gifts / Talents": "Type 7s bring joy, enthusiasm, and adaptability to every environment they enter. They are quick to try new things, courageous in brainstorming fresh ideas, and skilled at working on their feet. With a love for starting new projects, multitasking, and exploring a wide range of interests, they infuse teams with energy and curiosity. They bring people together, highlight shared gifts, and act as cheerleaders who build common ground. Naturally visionary, they see the big picture, anticipate positive outcomes, and think outside the box. Their leadership thrives on possibility, resourcefulness, and keeping momentum alive with optimism.",
    "Underlying Fear": "Fear of being trapped in pain or deprived. Avoids limitations, boredom.",
    "Core Values": "A wide variety of experiences, Accomplishment, Anything new and exciting, Being adventuresome, Being amused, Being energetic, Being happy-go-lucky yet practical, Being optimistic, Camaraderie, Challenge, Cheerfulness, Change and variety, Companionship, Contact with others, Conviviality, Contribution (to betterment of world), Creativity, Ecstatic appreciation for life, Egalitarianism, Enjoyment, Entertainment, Enthusiasm, Excitement and adventure, Fast pace, Freedom, Friendship, Full engagement with life, Gregariousness, Happiness, Hands-on work, Having fun, Having multiple options/choices, Humor & Wit, Imagination, Insatiable curiosity, Independence, Lightening others up, Laughter, Making others laugh, Meaningful work, New toys, Originality and creativity, Outdoor work, Pleasure, Positive possibility thinking, Productivity, Resourcefulness, Risk-taking, Sociability, Spontaneity, Time/Schedule flexibility, Unreservedness, Versatility.",
    "Strengths": "Optimistic, energetic, and future-focused. They see endless possibilities and inspire others with joy, playfulness, and fresh ideas. Natural motivators and networkers, they keep groups moving forward and make life feel like an adventure full of potential.",
    "Growth Edge / Blind Spot": "Cultivating depth and presence.",
    "Decision-Making Style": "Quick, optimistic, option-driven.",
    "Ideal Environment Needs": "Freedom, flexibility, stimulation.",
    "Stress / Breakdown Patterns": "Scattered, burnout from excess.",
    "Action Words": "Type 7s bring energy as they inspire, innovate, participate, empower, enjoy, excite, and dream.",
    "Energy Signature": "Skill Acquisition. Innovation. Enthusiasm. Variety. Exploration. Playfulness.",
    "Role Alignment Hints": "Type 7s thrive in roles that are dynamic, future-focused, and full of variety and possibility. They shine when their energy, curiosity, and optimism open new doors, but may falter if confined by rigid rules or forced to endure monotony.",
    "Examples of Aligned Roles": "Account executive, Actor/actress (especially comic), Adult literacy specialist, Advertising account executive, Advertising creative director, Advertising promotion manager, Advertising sales agent, Aerobics instructor, Agent/manager (of artists, performers), Agent/manager of athletes, Air traffic controller, Aircraft mechanic, Artist, Art director, Bar owner / Club owner, Casino owner / manager, Bartender, Boat/ship captain, Bungee jumping instructor, Business consultant, Carpenter, Chef, Child care worker, Children’s storyteller, Circus clown, Coach (life or business), Coach of an athlete, Columnist, Comedian/comedienne, Commentator, Conference programmer, Consultative manager / salesperson, Content creator, Corporate communications director, Corporate trainer, Correspondent, Costume designer, Counselors of all kinds, Craft worker, Creative director, multimedia team, Critical care nurse, Cruise Ship Worker / Director, Dancer, Desktop publisher, Designer, Dietitian/nutritionist, Director (stage, motion picture, TV), Disc jockey, Diversity manager, DJ, Digital Nomad, Educational consultant, Electrician, Emergency response worker, Employment interviewer, Entrepreneur, Family practitioner, Fashion Blogger, Film/TV camera operator, Film/TV producer, Fine artist, Firefighter, Fitness Instructor / Coach, Flight attendant, Flight instructor, Floral designer, Fundraiser/institutional solicitor, General contractor, Graphic artist/designer, Hair stylist, Independent trainer, Industrial psychologist, Instructional coordinator, Intelligence agent/specialist (i.e. FBI), Influencer, Interior Decorator, Interior Designer, Journalist, Landscape designer, Lawyer, Lifeguard, Literary agent, Life coach, Marketing, Marketing manager, Marketing specialist/consultant, Mason, Mechanic, Media planner, Media specialist, Mediator, Model, Motivational speaker, Multimedia specialist, Music composer, Musician, Negotiator, Nurse, Organizational development consultant, Paramedic/EMT, Party clown, Performer, Personal trainer, Philanthropic consultant/director, Photographer, Pilates instructor, Pilot, Playwright/screenwriter, Plumber, Podcast Host, Police officer or detective, Project Manager, Police officer or detective, Private investigator, Professional athlete, Promoter, Public health educator, Public relations director, Public relations specialist, Publicist, Publicity writer, Race car driver, Radio disc jockey, Referee/umpire, Religious educator/leader, Reporter, Rescue worker, Restaurant owner/manager, Restaurant Wait Staff, Rock climbing instructor, Rodeo clown, Scriptwriting, Sales agent (especially real estate,), Sales manager, School psychologist, Scout, Seasonal Tour Guide, Set designer, Shock jock (radio DJ), Singer, Ski patroller, Skydiving instructor, Small Business Owner, Social Media Influencer, Soul Cycle Instructor, Social scientist, Social workers of all kinds, Special Education, Special effects technician, Special events producer, Sports commentator, Sports event camera operator, Sports medicine specialist, Sports news reporter, Sports photographer, Sports team coach, Sports team manager, Sports team promoter/publicist, Sportswriter, Strategic partnership developer, Stunt man/woman, Talent director, Talk show host, Teachers of all kinds, Tour/travel guide, Translator, Travel Agent (with the benefit of being able to travel inexpensively), Travel writer, Traveling reporter, Trainer, Travel Blogger / Writer, TV Personality –– Actor or host, TV anchor/newscaster, TV game show host, TV talk show host, Wardrobe Designer, Website designer, Writer, Youtuber / instructor",
    "Leadreship Style": "Type 7 leaders are energetic, optimistic, and future-oriented. They spark creativity, innovation, and enthusiasm, encouraging others to think big and embrace possibility. Their leadership thrives in fast-moving, expansive environments where their adaptability, resourcefulness, and ability to uplift morale help teams thrive.",
    "Type Nicknames": "The Enthusiast. The Adventurer. The Generalist. The Visionary. The Epicure. The Explorer.",
    "Highest Work Fulfillment & Reward": "Type 7s flourish in dynamic, possibility-driven work that feels exciting and expansive. They need environments that value curiosity, flexibility, and variety, where they can explore new ideas and experiences. They feel most fulfilled when their optimism, adaptability, and vision bring energy, connection, and forward momentum to a team or project."
  },
  {
    "id": "type_8",
    "type_number": "Type 8",
    "Type Summary": "Type 8s are bold, justice-driven leaders whose strength lies in their fierce protection, directness, and unshakable will—but their greatest growth comes when they balance that power with vulnerability, empathy, and trust.",
    "Type Description": "Enneagram Type 8s, often called the Challenger, carry an indomitable presence that inspires confidence, protection, and decisive action. They are natural leaders who thrive in the face of challenge, standing firmly for justice and empowering others to claim their voice. Yet their relentless drive for control and resistance to vulnerability can at times create disconnection or burnout. At their best, 8s learn that true power is not just force but also openness—delegating, listening deeply, and embracing the strength of collaboration. When they root their leadership in empathy as much as assertiveness, they transform from forceful protectors into trusted, trailblazing leaders who embody both courage and heart.",
    "Core Drive / Key Motivation": "To be strong, in control, independent.",
    "Genius / Gifts / Talents": "Type 8s are strong, decisive, and committed leaders who value truth and integrity. They honor their word, overcome challenges head-on, and often inspire others by taking bold risks and being “all in.” They have a natural talent for running businesses, getting things done, and taking initiative. At the same time, they empower others by fostering independence, challenging them to believe in themselves, and pushing them toward practical action. Quick to assess others’ strengths and weaknesses, they see potential and demand growth. Fiercely protective of the vulnerable, they balance enforcement with bold vision and unstoppable momentum.",
    "Underlying Fear": "Fear of being controlled, weak, vulnerable. Avoids dependence and betrayal.",
    "Core Values": "Achievement, Ambition, Autonomy, Big-heartedness, Boldness, Challenge, Championing others, Control over their life, Competition, Contribution, Courage, Develop others’ potential, Decisiveness, Directness, Diversity and change, Drive, Empowering others, Excitement and adventure, Enterprising attitude, Fairness, Fast pace, Fearlessness, Financial independence, Freedom, Getting results, Goal achievement, Hard-work ethic, Having influence, High income, Honor and respect, Independence, Initiative, Intellectual stimulation, Justice, Leadership, Loyalty, Meaningful work, Power and authority, Pragmatism, Prestige, status, and/or wealth, Productivity, Protection, of self and others, Professional recognition, Providing, for self and others, Resourcefulness, Risk-taking, Self-assertiveness, Self-reliance, Shrewdness, Sovereignty, Street smarts, Strength, Time/schedule flexibility, Toughness, Trustworthiness.",
    "Strengths": "Bold, strong, and decisive. They embody confidence and courage, taking action when others hesitate. With resilience, strategy, and protectiveness, they defend the vulnerable and lead with clarity, ensuring progress in even the toughest circumstances.",
    "Growth Edge / Blind Spot": "Softening into vulnerability.",
    "Decision-Making Style": "Bold, decisive, confrontational.",
    "Ideal Environment Needs": "Autonomy, strength, respect.",
    "Stress / Breakdown Patterns": "Over-control, anger, exhaustion.",
    "Action Words": "Type 8s rise to advocate, protect, lead, apprentice, empower, provide, and impact.",
    "Energy Signature": "Leadership. Self-Assertiveness. Advocacy. Initiative. Power. Determination.",
    "Role Alignment Hints": "Type 8s thrive in roles that give them independence, responsibility, and room to act decisively. They shine when they can lead with strength and protect others, but can clash in environments that feel weak, unfair, or overly controlling.",
    "Examples of Aligned Roles": "Activist, Administrator, Advertising Executive, Athlete, Attorney, Banker, Business Consultant, Business Executive, CEO, Coach, Commander, Contractor, Corporate Executive, Corporate Lawyer, Detective, Director, Doctor, Editor, Entrepreneur, Executive, Film Director, Financial Advisor, Government Official, Head of State, Human Rights Advocate, Industrialist, Insurance Broker, Judge, Law Enforcement Officer, Lawyer, Lobbyist, Manager, Military Officer, Motivational Speaker, Negotiator, Organizer, Philanthropist, Physician, Pilot, Politician, Principal, Producer, Professional Athlete, Real Estate Developer, Religious Leader, Sales Executive, School Superintendent, Scientist, Social Reformer, Soldier, Stockbroker, Supervisor, Surgeon, Teacher, Trade Union Leader, Venture Capitalist.",
    "Leadreship Style": "Type 8 leaders embody strength, decisiveness, and protection. They lead with boldness and conviction, taking charge in challenging situations and advocating fiercely for their people. Their contribution is creating impact through action, empowering others, and fostering environments of justice, strength, and resilience.",
    "Type Nicknames": "The Challenger. The Protector. The Defender. The Advocate. The Leader. The Commander.",
    "Highest Work Fulfillment & Reward": "Type 8s excel in roles that allow them to take initiative, act decisively, and harness their strength for impact. They need environments that reward persistence, straightforwardness, and practical results, while trusting them to lead without micromanagement. They feel most fulfilled when their boldness, resilience, and advocacy empower others and create meaningful change."
  },
  {
    "id": "type_9",
    "type_number": "Type 9",
    "Type Summary": "Type 9s seek harmony and belonging, gifted with the ability to unify others and create peace. Their growth comes from finding their own voice—balancing empathy with self-assertion—so they can lead and live with both serenity and impact.",
    "Type Description": "At their best, Type 9s are natural peacemakers who bring calm, inclusivity, and perspective to those around them. They intuitively sense multiple viewpoints and foster environments where collaboration and connection thrive. Yet their longing for harmony can sometimes turn into self-forgetting—avoiding conflict, deferring decisions, or minimizing their own desires. The deeper invitation of the Nine is to awaken to their own power, discovering that peace is not passivity but the courage to be fully present, engaged, and decisive. When they learn to assert themselves while honoring their gift for empathy, they embody a leadership that is both grounded and unifying. In this balance, they find their true purpose: living as a steady force of belonging while making their own clear and valued contribution to the world.",
    "Core Drive / Key Motivation": "To have peace, harmony, inner stability.",
    "Genius / Gifts / Talents": "Type 9s lead with patience, receptivity, and quiet strength. They are deeply skilled at listening, accepting people as they are, and appreciating differences without judgment. With a natural ability to go with the flow, they bring calm to others and help them enjoy life’s simple pleasures. They consistently look for the good in situations and people, while also expressing themselves creatively and philosophically. As mediators, they are gifted at diffusing conflict and fostering cooperation, often becoming a steady presence in times of discord. With persistence and grace, they guide teams toward unity and shared goals.",
    "Underlying Fear": "Fear of conflict, loss, fragmentation. Avoids tension and disconnection.",
    "Core Values": "Acceptance of what is, Adaptability, Aesthetics and beauty, Being understanding, Calmness, Clear directions, Close friendships with coworkers, Close group/team work, Comfortable routines, Companionship, Conviviality, Cooperation, Creativity and originality, Diplomacy, Dislike of conflict, Emotional well-being, Empathy, Feeling connected, Finding unity, Following traditional values, Relationships, Generosity, Gentleness & Kindness, Guilelessness, Harmony, Help others directly, Humbleness, Imagination, Inclusiveness, Inner stability, Live-and-let-live attitude, Loyalty, Mellowness, Meaningful work, Open communication, Open-mindedness, Optimism, Patience, Peaceful environment, Peace of mind, Positive influence, Predictability, Receptivity, Relaxation, Security and stability, Seeing others’ viewpoints, Self-awareness, Serenity, Sense of mission, Sociability, Steadfastness, Supportiveness, Time/schedule flexibility, Unselfishness.",
    "Strengths": "Gentle, patient, and deeply fair. They bring people together, soothe conflict, and hold space with calm endurance. As compassionate listeners and bridge-builders, they offer acceptance and harmony, becoming the steady glue that holds communities together.",
    "Growth Edge / Blind Spot": "Claiming their own voice.",
    "Decision-Making Style": "Consensus-seeking, steady, accommodating.",
    "Ideal Environment Needs": "Harmony, stability, acceptance.",
    "Stress / Breakdown Patterns": "Avoidance, disengagement, numbing.",
    "Action Words": "Type 9s embody the ability to accept, include, integrate, peacemake, adapt, endure, harmonize, and persist.",
    "Energy Signature": "Receptivity. Harmony. Mediation. Acceptance. Peace. Steadfastness.",
    "Role Alignment Hints": "Type 9s thrive in roles that foster harmony, cooperation, and steady progress toward shared goals. They shine when they can use their calm presence and diplomacy to build unity, but risk stagnation if pressured by conflict or overlooked in group dynamics.",
    "Examples of Aligned Roles": "Acupuncturist, Administrator, Advisor, Advocate, Ambassador, Anthropologist, Archaeologist, Artist, Astrologer, Author, Botanist, Caregiver, Chaplain, Chiropractor, Clergy, Coach, Counselor, Diplomat, Doctor, Editor, Environmentalist, Farmer, Film Editor, Foreign Service Officer, Gardener, Guidance Counselor, Healer, Historian, Holistic Health Practitioner, Hospice Worker, Human Resources Specialist, Librarian, Massage Therapist, Mediator, Minister, Missionary, Music Therapist, Musician, Nurse, Nutritionist, Occupational Therapist, Painter, Paralegal, Pastoral Counselor, Peace Corps Worker, Philosopher, Physical Therapist, Physician, Poet, Politician, Professor, Psychologist, Psychotherapist, Researcher, Scientist, Sculptor, Social Worker, Sociologist, Spiritual Teacher, Teacher, Translator, Veterinarian, Volunteer Coordinator, Writer, Yoga Instructor.",
    "Leadreship Style": "Type 9 leaders bring calm presence, diplomacy, and inclusivity. They excel at mediation, uniting diverse perspectives, and fostering cooperative environments. Their leadership strength is cultivating peace, steady progress, and stability while ensuring everyone feels seen, heard, and valued.",
    "Type Nicknames": "The Mediator. The Peacemaker. The Space-Holder. The Counselor. The Harmonizer. The Healer.",
    "Highest Work Fulfillment & Reward": "Type 9s thrive in environments that emphasize harmony, cooperation, and mutual respect. They need work that allows them to use their gifts of listening, patience, and mediation without constant pressure or conflict. They feel most fulfilled when their calm presence, nonjudgment, and ability to unite diverse perspectives foster peace and steady progress."
  }
]

    