{
  "SP/SX": {
    "summary": "Grounded, safety-focused, self-sufficient, craves organization, curates beautiful space, private with commitments, values finances and wellness, seeks security through partnership, sees others deeply, neglects group belonging, rebels against conformity",
    "description": "The SP/SX instinctual stacking is driven by a need for physical security, safety, and self-sufficiency. These individuals are grounded and practical, often creating beauty and order in their environment while remaining private or cautious about commitments. They value financial stability and wellness above all and often look to partnerships that support security and survival. They are perceptive and “see” others deeply, but group belonging or fitting into collective roles is often neglected or resisted. Social expectations may feel irrelevant or constraining, leading to a sense of independence and quiet rebellion.",
    "repressedInstinctIssues": "Rebels against social cues, unaware of group impact, awkward fit, individualistic, not team-oriented, prioritizes intense bonding over reciprocity, no social filter, chemistry over discernment"
  },
  "SP/SO": {
    "summary": "Security-driven, practical, grounded, status-seeking, businesslike, sober, goal-oriented, connects through organizations and shared beliefs, values community for support, less focused on attraction, cautious in intimacy",
    "description": "The SP/SO stacking is rooted in the drive for physical security and safety, with a strong orientation toward stability, status, and practicality. These individuals appear sober, cool, and businesslike, preferring grounded approaches to achieving goals. They rely on community and organizations for support, often connecting over shared beliefs and using group affiliations to advance their aims. Attraction and intensity are less of a focus, as they tend to prioritize common values and practical partnerships over chemistry alone. Intimacy requires trust and effort, as passion is often secondary to the pursuit of stability and achievement.",
    "repressedInstinctIssues": "Distant emotionally, hard to reach in intimacy, unaware of passion or attraction, avoids eye contact and intensity, neglects chemistry, favors logic over love, resists hormonal or instinctual drives"
  },
  "SX/SP": {
    "summary": "Intense, passionate, mate-seeking, craves attention and merging, seeker, tuned to intimacy, hot and magnetic, uses resources and home life to support closeness, neglects group belonging, unconcerned with conformity",
    "description": "The SX/SP stacking is led by the drive for intimacy and intense bonding. These individuals are seekers who long for merging, passion, and deep one-on-one attention, often appearing magnetic, “hot,” and deeply tuned to others. Self-preservation needs—such as home, safety, and finances—tend to be in service of relationships and intimacy, used to create stability for connection. Group belonging and social concerns are often neglected, as these individuals prioritize passion and self-sufficiency over fitting in or aligning with collective roles. Their energy is directed toward closeness and intensity rather than community life.",
    "repressedInstinctIssues": "Rebels against social cues, unaware of group impact, awkward fit, individualistic, not team-oriented, prioritizes intense bonding over reciprocity, no social filter, chemistry over discernment"
  },
  "SX/SO": {
    "summary": "Charismatic, fiery, conviction-driven, seeks intimacy and merging, passionate about beliefs, identifies with groups to serve closeness, neglects self-pres needs, may ignore health and finances, drawn to what’s outside over bodily care",
    "description": "The SX/SO stacking is fueled by intensity and the drive for deep, intimate connection. These individuals are charismatic, fiery, and convicted in their beliefs, often seeking a partner or cause that allows them to merge and feel alive. Their secondary focus on the social instinct serves their sexual drive, connecting them strongly to groups, ideologies, and shared visions as a way to amplify closeness and passion. Self-preservation tends to be a blindspot, leading to neglect of bodily care, financial stability, or basic physical needs. Instead, they are oriented toward what is outside and beyond, finding ordinary self-care dull compared to pursuing intensity and connection.",
    "repressedInstinctIssues": "Neglects survival needs, ignores body limits, frustrated by illness, dislikes menial tasks, uninterested in wealth or belongings, avoids long-term foundations"
  },
  "SO/SP": {
    "summary": "Group-focused, role-oriented, values likemindedness, merges values with group, idealistic, grounded in resources and home life to support social aims, neglects intimacy, wary of losing identity in partnership, sees attraction as risky",
    "description": "The SO/SP stacking prioritizes social belonging and group support above all else. These individuals are most comfortable when serving the needs of the collective, finding their place, and merging values with others. They are idealistic about how things should work and often use self-preservation needs like stability, finances, and home life as a foundation to enhance their social role. Intimacy and passion tend to be blindspots, as closeness may feel threatening to their independence or distracting from group priorities. Attraction may even feel reckless, as their identity is most strongly rooted in their social contributions and place within the community.",
    "repressedInstinctIssues": "Distant emotionally, hard to reach in intimacy, unaware of passion or attraction, avoids eye contact and intensity, neglects chemistry, favors logic over love, resists hormonal or instinctual drives"
  },
  "SO/SX": {
    "summary": "Group-focused, skilled socially, adaptable, values belonging and support, fosters relationships in the moment, seeks prestige through the right partner, authentic and cool, less committed long-term, neglects self-pres needs, not money-minded, prefers short-term benefits",
    "description": "The SO/SX stacking leads with a strong orientation toward groups, belonging, and fostering social relationships. These individuals are adaptable, skilled at navigating the social realm, and thrive when supporting or contributing to the needs of a community. Their sexual instinct amplifies their social drive, often tying intimacy to prestige or authenticity, though they may be less committed in long-term relationships, preferring connections that feel immediate and “cool.” Self-preservation tends to be their blindspot, leaving them less focused on long-term security, finances, or practical investments. Instead, they prefer reaping immediate rewards and experiences over delayed stability.",
    "repressedInstinctIssues": "Neglects survival needs, ignores body limits, frustrated by illness, dislikes menial tasks, uninterested in wealth or belongings, avoids long-term foundations"
  }
}
